/******************************************************************************
*        
*     		Copyright (c) 2018 苏州速显微电子科技有限公司.   
*        
*******************************************************************************
*  file name:           
*  author:              ChengBingBing
*  version:             1.00
*  file description:    
*******************************************************************************
*  revision history:    date               version                  author
*
*  change summary:
*
******************************************************************************/
#ifndef __CRC_H__
#define __CRC_H__

#ifdef __cplusplus
extern "C" {
#endif

/******************************************************************************
* Include Files
******************************************************************************/
#include "stm32f1xx.h"

/**
  * @brief  CRC校验或CRC校验码生成
  * @note	1.当作为CRC校验使用时，len为有效数据长度+紧随有效数据后的2字节CRC校验码
  *			2.当作为CRC校验码生成时，len为有效数据长度，返回值为生成的CRC校验码
  * @param  dat: 待生成校验码的数据或待校验的数据
  * @param  len: 待生成校验码的数据或待校验的数据长度
  * @retval 1. 当作为CRC校验时，返回值为0表示CRC校验成功，否则检验失败
  *         2. 当作为CRC校验码生成时，返回值为CRC校验码
  */
uint16_t CRC_Crc16Modbus( uint8_t* dat, uint16_t len );

#ifdef __cplusplus
}
#endif

#endif
